Revit 2027 API
ParameterTypeId.BoundaryRestraintX Property
 "X Spring Modulus"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BoundaryRestraintX { get; }
Public Shared ReadOnly Property BoundaryRestraintX As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BoundaryRestraintX {
	ForgeTypeId^ get ();
}
static member BoundaryRestraintX : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace